
let obj = `
0	,1	,Offices,    16 , المظهر العام
,0	,1	,Offices,    17 , النظافة
,0	,1	,Offices,    18 , سهولة الوصول للفرع
,0	,1	,Offices,    19 , ساعات العمل
,0	,1	,Offices,    20 , الأمن و السلامة العامة
,0	,2	,Behavior,    21 , تقصير في الأداء
,0	,2	,Behavior,    22 , سوء التعامل
,0	,2	,Behavior,    23 , فساد
,0	,3	,Sevices,    1 , السجل التجاري
,0	,3	,Sevices,    2 , الاسماء التجارية
,0	,3	,Sevices,    4 , خدمات المهن الاستشارية
,0	,3	,Sevices,    5 , خدمات الشركات
,0	,3	,Sevices,    7 , تراخيص المختبرات
,0	,3	,Sevices,    8 , شهادة المنشأ
,0	,3	,Sevices,    9 , اللجان شبه القضائية
,0	,3	,Sevices,    10 , أعمال الفسح
,0	,3	,Sevices,    11 , الوكالات التجارية
,0	,3	,Sevices,    12 , تراخيص الذهب و المعادن الثمينة
,0	,3	,Sevices,    13 , خدمات مكتب الفصل في المنازعات التجارية
,0	,3	,Sevices,    14 , تراخيص التخفيضات
,0	,3	,Sevices,    15 , التصاريح الموسمية لمركبات الخدمات التموينية
,0	,3	,Sevices,    24 , التزام الشركات
,0	,3	,Sevices,    25 , حوكمة الشركات
,0	,3	,Sevices,    26 , الغرفة التجارية
,0	,3	,Sevices,    30 , الفرع الالكتروني
,0	,3	,Sevices,    31 , معروف
,0	,3	,Sevices,    32 , الدخول الموحد
,0	,3	,Sevices,    33 , التجديد بخطوة
,0	,3	,Sevices,    34 , خدمات منصة SBC
,0	,3	,Sevices,    35 , المخالفات
,0	,3	,Sevices,    66 , المراقب الموحد
,1	,1	,Commercial Register,    1 , اصدار سجل تجاري رئيسي مؤسسة للسعوديين
,1	,1	,Commercial Register,    2 , اصدار سجل تجاري فرعي مؤسسة للسعوديين
,1	,1	,Commercial Register,    3 , تجديد سجل تجاري رئيسي مؤسسة للسعوديين
,1	,1	,Commercial Register,    4 , تجديد سجل  تجاري فرعي مؤسسة للسعوديين
,1	,1	,Commercial Register,    5 , تعديل نشاط سجل تجاري مؤسسة للسعوديين
,1	,1	,Commercial Register,    6 , تعديل عنوان  سجل تجاري مؤسسة للسعوديين
,1	,1	,Commercial Register,    7 , تعديل راس مال  سجل تجاري مؤسسة للسعوديين
,1	,1	,Commercial Register,    8 , تعيين مدير مؤسسة للسعوديين
,1	,1	,Commercial Register,    9 , شطب سجل تجاري  رئيسي مؤسسة للسعوديين
,1	,1	,Commercial Register,    10 , افادة عدم وجود سجلات
,1	,1	,Commercial Register,    11 , افادة (افراد)
,1	,1	,Commercial Register,    12 , مستخرج مؤسسة 
,1	,1	,Commercial Register,    13 , اصدار سجل رئيسي شركة لمواطن سعودي 
,1	,1	,Commercial Register,    14 , اصدار سجل تجاري رئيسي شركة للخليجيين
,1	,1	,Commercial Register,    15 , تجديد سجل  تجاري فرعي لشركة
,1	,1	,Commercial Register,    16 , تجديد سجل تجاري  رئيسي شركة للسعوديين
,1	,1	,Commercial Register,    17 , تجديد سجل تجاري  رئيسي شركة للخليجيين
,1	,1	,Commercial Register,    18 , تحويل المؤسسة الى شركة
,1	,1	,Commercial Register,    19 , تحويل السجل التجاري من رئيسي إلى فرعي أو العكس
,1	,1	,Commercial Register,    20 , مستخرج شركة
,1	,1	,Commercial Register,    21 , اصدار سجل تجاري رئيسي مؤسسة للخليجين
,1	,1	,Commercial Register,    22 , اصدار سجل تجاري فرعي مؤسسة للخليجين
,1	,1	,Commercial Register,    26 , اصدار تراخيص مكاتب الخدمات العامة
,1	,1	,Commercial Register,    27 , تجديد  تراخيص مكاتب الخدمات العامة
,1	,1	,Commercial Register,    28 , الغاء  تراخيص مكاتب الخدمات العامة
,1	,1	,Commercial Register,    29 , تجديد سجل تجاري رئيسي مؤسسة للخليجين
,1	,1	,Commercial Register,    30 , تجديد سجل تجاري فرعي مؤسسة للخليجين
,1	,1	,Commercial Register,    31 , تعديل نشاط  سجل تجاري مؤسسة للخليجين
,1	,1	,Commercial Register,    32 , تعديل عنوان  سجل تجاري مؤسسة للخليجين
,1	,1	,Commercial Register,    33 , تعديل راس مال سجل تجاري مؤسسة للخليجين
,1	,1	,Commercial Register,    34 , شطب  سجل تجاري فرعي مؤسسة للخليجين
,1	,1	,Commercial Register,    35 , تعيين مدير مؤسسة للخليجيين
,1	,1	,Commercial Register,    36 , تصحيح السجلات المربوطة بالحفيظة 
,1	,1	,Commercial Register,    37 , المؤسسات الوقفية
,1	,1	,Commercial Register,    38 , المؤسسات الخيرية
,1	,1	,Commercial Register,    39 , الجمعيات التعاونية 
,1	,1	,Commercial Register,    40 , نقل ملكية سجل تجاري مؤسسة للسعوديين
,1	,1	,Commercial Register,    41 , نقل ملكية سجل تجاري مؤسسة للخليجيين
,1	,1	,Commercial Register,    42 , اصدار سجل تجاري فرعي لشركة 
,1	,1	,Commercial Register,    43 , تجديد سجل تجاري رئيسي شركة مساهمة
,1	,1	,Commercial Register,    44 , تجديد سجل تجاري فرعي شركة مساهمة
,1	,1	,Commercial Register,    45 , تجديد سجل تجاري رئيسي شركة مهنية
,1	,1	,Commercial Register,    46 , تجديد سجل تجاري فرعي شركة مهنية
,1	,1	,Commercial Register,    47 , تجديد سجل تجاري رئيسي شركة قابضة
,1	,1	,Commercial Register,    48 , تجديد سجل تجاري فرعي شركة قابضة
,1	,1	,Commercial Register,    50 , تعديل سجل تجاري رئيسي لشركة مساهمة مغلقة 
,1	,1	,Commercial Register,    51 , تعديل سجل تجاري فرعي لشركة مساهمة مغلقة 
,1	,1	,Commercial Register,    52 , تعديل سجل تجاري رئيسي لشركة مساهمة مدرجة
,1	,1	,Commercial Register,    53 , تعديل سجل تجاري فرعي لشركة مساهمة مدرجة 
,1	,1	,Commercial Register,    54 , شطب  سجل تجاري رئيسي شركة للسعوديين
,1	,1	,Commercial Register,    55 , شطب  سجل تجاري رئيسي شركة  للخليجيين
,1	,1	,Commercial Register,    56 , شطب  سجل تجاري رئيسي شركة  لفروع الشركات  الأجنبية
,1	,1	,Commercial Register,    57 , شطب  سجل تجاري رئيسي شركة  لفروع الشركات الخليجية
,1	,1	,Commercial Register,    58 , شطب  سجل تجاري رئيسي لشركة مختلطة
,1	,1	,Commercial Register,    59 , شطب  سجل تجاري رئيسي لشركة مساهمة
,1	,1	,Commercial Register,    61 , شطب سجل فرع شركة 
,1	,1	,Commercial Register,    62 , تحويل السجل التجاري من شركة إلى مؤسسة
,1	,1	,Commercial Register,    166 , شطب سجل تجاري  فرعي مؤسسة للسعوديين
,1	,1	,Commercial Register,    167 , شطب سجل تجاري رئيسي مؤسسة للخليجين
,1	,1	,Commercial Register,    185 , تحويل السجل التجاري الرئيسي  إلى فرعي أو العكس للخليجيين
,1	,1	,Commercial Register,    186 , تعديل السجل التجاري للشركات
,1	,1	,Commercial Register,    187 , شطب سجل تجاري لشخص متوفي
,1	,1	,Commercial Register,    188 , نقل ملكية سجل تجاري من شخص متوفى
,1	,1	,Commercial Register,    189 , ترجمة السجل التجاري
,1	,1	,Commercial Register,    190 , تجديد السجل التجاري بخطوة
,1	,1	,Commercial Register,    194 , إستعادة السجل التجاري المشطوب
,1	,1	,Commercial Register,    196 , الرقم الوطني الموحد 700
,1	,1	,Commercial Register,    198 , QR الرمز التجاري
,1	,1	,Commercial Register,    804010000 , استرجاع النشاط السابق لما قبل تنفيذ عملية العكس
,1	,1	,Commercial Register,    348 , تحديث السجل التجاري
,1	,2	,Trade names,    63 , حجز اسم تجاري لسعودي
,1	,2	,Trade names,    64 , حجز اسم تجاري لخليجي
,1	,2	,Trade names,    65 , حجز اسم تجاري للجهات الحكومية وشبه الحكومية
,1	,2	,Trade names,    66 , حجز اسم تجاري أجنبي
,1	,2	,Trade names,    67 , إعادة فحص اسم مرفوض إلكترونياً
,1	,2	,Trade names,    199 , اعتراض على رفض حجز الاسم التجاري
,1	,4	,Consulting professions services,    70 , التراخيص الجديدة للمهن الاستشارية
,1	,4	,Consulting professions services,    71 , إصدار رخصة فرع مكتب مهني
,1	,4	,Consulting professions services,    72 , تجديد الرخص المهنية
,1	,4	,Consulting professions services,    73 , تعديل الرخص المهنية
,1	,4	,Consulting professions services,    74 , الغاء التراخيص المهنية
,1	,4	,Consulting professions services,    370 , تعديل بيانات المستخدم
,1	,5	,Corporate Services,    78 , تأسيس الشركات المحدودة-تضامنية-توصية بسيطة
,1	,5	,Corporate Services,    79 ,  قرارات الشركاء الجديد
,1	,5	,Corporate Services,    80 , الافادات - خدمات الشركات
,1	,5	,Corporate Services,    81 , تحديث بيانات الشركات
,1	,5	,Corporate Services,    82 , تأسيس الشركات القابضة (ذات المسئولية المحدودة – مساهمة )
,1	,5	,Corporate Services,    83 , فتح فروع شركات خليجية 
,1	,5	,Corporate Services,    84 , تعديل فروع شركات خليجية
,1	,5	,Corporate Services,    85 , تجديد  فروع شركات خليجية
,1	,5	,Corporate Services,    86 , فتح فروع لشركات أجنبية
,1	,5	,Corporate Services,    87 , تعديل فروع شركات أجنبية 
,1	,5	,Corporate Services,    88 , تجديد  فروع شركات أجنبية
,1	,5	,Corporate Services,    89 , فتح (فروع) لفروع شركات خليجية 
,1	,5	,Corporate Services,    90 , تعديل (فروع) لفروع شركات خليجية 
,1	,5	,Corporate Services,    91 , تجديد  (فروع) لفروع شركات خليجية 
,1	,5	,Corporate Services,    92 , شطب  (فروع) لفروع شركات خليجية 
,1	,5	,Corporate Services,    93 , فتح (فروع) لفروع شركات أجنبية 
,1	,5	,Corporate Services,    94 , تعديل (فروع) لفروع شركات أجنبية 
,1	,5	,Corporate Services,    95 , تجديد  (فروع) لفروع شركات أجنبية 
,1	,5	,Corporate Services,    96 , شطب  (فروع) لفروع شركات أجنبية  
,1	,5	,Corporate Services,    98 , تأسيس الشركات المهنية
,1	,5	,Corporate Services,    99 , تحويل الكيان القانوني لشركة المساهمة الى شركة ذات مسئولية محدودة
,1	,5	,Corporate Services,    100 , تحويل من شركة ذات مسؤولية محدودة الى شركة مساهمة مقفلة 
,1	,5	,Corporate Services,    197 , قرارات الشركاء القديم
,1	,5	,Corporate Services,    201 , حذف طلب تحديث مقبول بالخطأ
,1	,5	,Corporate Services,    349 , ترجمة عقود
,1	,5	,Corporate Services,    350 , ترجمة السجل التجاري للشركات
,1	,5	,Corporate Services,    351 , تحديث سجل تجاري شركة (رئيسي - فرعي)
,1	,24	,Corporate commitment,    101 , استقبال الشكاوى من المساهمين والشركاء
,1	,24	,Corporate commitment,    169 , إفادة الجهات الحكومية
,1	,24	,Corporate commitment,    170 , الرد على إدارات الشركات بخصوص رفع الحجب التأشير
,1	,25	,Corporate Governance,    168 , ايقاف السجلات  ورفع الايقاف
,1	,25	,Corporate Governance,    171 , نشر قرارات الجمعية العامة غير العادية
,1	,25	,Corporate Governance,    173 , الافادات للشركات المساهمة
,1	,25	,Corporate Governance,    174 , دراسة النظام الأساسي للشركات المساهمة المدرجة
,1	,25	,Corporate Governance,    110 , طلبات تأسيس الشركات المساهمة
,1	,25	,Corporate Governance,    181 , متابعة إحاطة الوزارة بالجمعية
,1	,25	,Corporate Governance,    182 , تحديث سجل المساهمين
,1	,25	,Corporate Governance,    200 , نشر القرارات المساهمة
,1	,6	,Trademarks,    111 , تسجيل العلامة التجارية ( أفراد 0 منشأت - جهات حكومية وشبة حكومية)
,1	,6	,Trademarks,    112 , تجديد علامة تجارية 
,1	,6	,Trademarks,    113 , اعتراض على قرار قبول تسجيل علامة تجارية
,1	,6	,Trademarks,    114 , تظلم على رفض تسجيل علامة تجارية
,1	,6	,Trademarks,    115 , قيد وكيل تسجيل علامة تجارية في سجل الوكلاء
,1	,6	,Trademarks,    116 , نقل ملكية العلامة التجارية
,1	,6	,Trademarks,    117 , تعديل اسم المالك أو العنوان أو العلامة أو الوكيل
,1	,6	,Trademarks,    118 , الغاء الترخيص باستخدام العلامة التجارية
,1	,6	,Trademarks,    119 , شطب العلامة التجارية او شطب بعض السلع أو الخدمات
,1	,6	,Trademarks,    120 , الترخيص باستخدام العلامة التجارية
,1	,6	,Trademarks,    121 , رهن/فك رهن العلامة التجارية
,1	,6	,Trademarks,    122 , صور شهادة التسجيل طبق الأصل/مستخرج
,1	,6	,Trademarks,    123 , البحث عن علامة تجارية
,1	,6	,Trademarks,    124 , شهادة إيداع علامة تجارية
,1	,7	,Laboratory Licenses,    125 , ترخيص مبدئي لمختبر
,1	,7	,Laboratory Licenses,    126 , ترخيص نهائي لمختبر
,1	,8	,Certificate of Origin,    128 , إصدار شهادة منشأ 
,1	,8	,Certificate of Origin,    129 , تعديل شهادة المنشأ
,1	,8	,Certificate of Origin,    130 , إستخراج بدل فاقد لشهادة المنشأ
,1	,8	,Certificate of Origin,    131 , إصدار نسخة طبق الأصل
,1	,8	,Certificate of Origin,    132 , إلغاء شهادة منشأ
,1	,8	,Certificate of Origin,    133 , إصدار شهادة منشأ بأثر رجعي
,1	,8	,Certificate of Origin,    364 , طباعة شهادة منشأ
,1	,8	,Certificate of Origin,    365 , منتجات شهادة المنشأ
,1	,8	,Certificate of Origin,    366 , توقيع شهادة المنشأ
,1	,8	,Certificate of Origin,    367 , مستوردين شهادة المنشأ
,1	,8	,Certificate of Origin,    368 , طلبات شهادة المنشأ
,1	,8	,Certificate of Origin,    369 , رصيد شهادة المنشأ
,1	,9	,Paralegal Committees,    135 , الفصل في المخالفات النظامية وأيقاع الغرامات والجزاءات
,1	,9	,Paralegal Committees,    137 , الفصل في الشكاوى المقدمة من أصحاب الشأن المتعلقة بالأسماء التجارية
,1	,9	,Paralegal Committees,    139 , تسليم قرار لجنة التحقيق وتوقيع العقوبات في نظام الأسماء التجارية.
,1	,9	,Paralegal Committees,    140 , تسليم قرار لجنة النظر  في مخالفات نظام الشركات
,1	,9	,Paralegal Committees,    141 , تسليم قرار لجنة توقيع عقوبات نظام السجل التجاري.
,1	,9	,Paralegal Committees,    142 , تسليم قرار لجنة الفصل في مخالفات نظام المعادن الثمينة والأحجار الكريمة.
,1	,9	,Paralegal Committees,    143 , تسليم قرار هيئة تطبيق العقوبات الواردة في نظام الوكالات التجارية.
,1	,10	,Glades,    144 , الفسح الكيميائي -إصدار إذن استيراد للمواد الكيميائية الخطرة
,1	,10	,Glades,    145 , الفسح الكيميائي -إصدار إذن استيراد للمواد الكيميائية غير الخطرة
,1	,10	,Glades,    146 , الفسح الكيميائي - إصدار إذن فسح لأجهزة التقطير 
,1	,10	,Glades,    147 , الفسح الكيميائي -إصدار ترخيص مزاولة نشاط استيراد مواد تابعة لاتفاقية حظر الاسلحة الكيميائية
,1	,10	,Glades,    148 , الفسح الكيميائي-إصدار اذن فسح مواد تابعة لاتفاقية حظر الأسلحة الكيميائية
,1	,10	,Glades,    149 , الفسح الجمركي للبضائع 
,1	,11	,Commercial Agencies,    150 , طلب تسجيل قيد وكالة تجارية 
,1	,11	,Commercial Agencies,    151 , طلب تجديد قيد  وكالة تجارية 
,1	,11	,Commercial Agencies,    153 , طلب تعديل في العقود او السجلات التجارية للوكيل او الموزع
,1	,11	,Commercial Agencies,    154 , طلب شطب قيد وكالة تجارية من الوكيل
,1	,11	,Commercial Agencies,    155 , طلب شطب قيد وكالة تجارية من الموكل 
,1	,12	,Gold and precious metals licenses,    156 , ترخيص المعادن الثمينة والاحجار الكريمة 
,1	,12	,Gold and precious metals licenses,    157 , تعديل تراخيص المعادن الثمينة والاحجار الكريمة
,1	,12	,Gold and precious metals licenses,    158 , شطب تراخيص المعادن الثمينة والاحجار الكريمة
,1	,12	,Gold and precious metals licenses,    159 , بدل فاقد ترخيص معادن ثمينة
,1	,13	,Services of the Office for the Settlement of Commercial Disputes,    160 , طلب الاعتراض ضد قرار مكتب الفصل
,1	,13	,Services of the Office for the Settlement of Commercial Disputes,    161 , طلب دفع مبلغ عقوبتي الغرامة والتشهير وطلب رفع الأسم من قائمتي إيقاف الخدمات والقبض
,1	,13	,Services of the Office for the Settlement of Commercial Disputes,    162 , استلام قرار مكتب الفصل وختمه بصيغة التنفيذ
,1	,13	,Services of the Office for the Settlement of Commercial Disputes,    163 , طلب إعادة فتح الدعوى بعد الشطب
,1	,14	,Discount Licenses,    164 , اصدار تراخيص التخفيضات
,1	,15	,Discount Licenses,    183 , طلبات الموافقة علي العروض الترويجية
,1	,15	,Seasonal permits for ration vehicles,    165 , خدمة التصاريح الموسمية لمركبات الخدمات التموينية لشركات الاعاشة والتغذية 
,1	,26	,Chamber of Commerce,    191 , إصدار
,1	,26	,Chamber of Commerce,    192 , تجديد
,1	,26	,Chamber of Commerce,    193 , مزامنة
,1	,26	,Chamber of Commerce,    371 , الفواتير المفقودة لنظام الغرف التجارية
,1	,27	,E-shops,    195 , تسجيل/تفعيل المتاجر الإلكترونية
,1	,28	,Commercial Report Application,    202 , الدخول على التطبيق
,1	,28	,Commercial Report Application,    203 , رفع البلاغ
,1	,30	,الفرع الالكتروني,    300 , اصدار سجل تجاري رئيسي – فرعي لشركة اجنبية
,1	,30	,الفرع الالكتروني,    301 , اصدار سجل تجاري رئيسي او فرعي لمؤسسة لمواطني دول مجلس التعاون
,1	,30	,الفرع الالكتروني,    302 , التحويل من فرع شركة الى فرع شركة أخرى 
,1	,30	,الفرع الالكتروني,    303 , اصدار سجل تجاري رئيسي – فرعي لشركة – مختلطة
,1	,30	,الفرع الالكتروني,    304 , تجديد سجل تجاري رئيسي او فرعي لمؤسسة لمواطني دول مجلس التعاون
,1	,30	,الفرع الالكتروني,    305 , اصدار سجل تجاري رئيسي لفرع شركة اجنبية
,1	,30	,الفرع الالكتروني,    306 , اصدار سجل تجاري رئيسي لفرع شركة خليجية
,1	,30	,الفرع الالكتروني,    307 , اصدار سجل تجاري فرعي لشركة مساهمة
,1	,30	,الفرع الالكتروني,    308 , اصدار سجل تجاري لشركة مهنية سعودية او مختلطة
,1	,30	,الفرع الالكتروني,    309 , التحويل من فرع شركة الى مؤسسة رئيسي – فرعي
,1	,30	,الفرع الالكتروني,    310 , تجديد السجل التجاري لشركة مهنية او مختلطة
,1	,30	,الفرع الالكتروني,    311 , العقود التي يكون نشاطها مرخص من هيئة السوق المالية بحصر على نشاط معين
,1	,30	,الفرع الالكتروني,    312 , العقود التي يكون أحد أطراف العقد جهة حكومية
,1	,30	,الفرع الالكتروني,    313 , العقود التي تحمل أحكام قضائية
,1	,30	,الفرع الالكتروني,    314 , تجديد سجل تجاري رئيسي – فرعي لشركة – مختلطة
,1	,30	,الفرع الالكتروني,    315 , تجديد سجل تجاري رئيسي – فرعي لشركة – أجنبية
,1	,30	,الفرع الالكتروني,    316 , تجديد سجل تجاري رئيسي او فرعي لشركة للخليجي
,1	,30	,الفرع الالكتروني,    317 , تحويل السجل من فرعي الى رئيسي لمؤسسة لمواطني دول مجلس التعاون
,1	,30	,الفرع الالكتروني,    318 , تحويل المؤسسات التي يكون مالكها صك وقف أو جهة حكومية إلى شركة مستقلة
,1	,30	,الفرع الالكتروني,    319 , تجديد سجل تجاري رئيسي لفرع شركة خليجية
,1	,30	,الفرع الالكتروني,    320 , تجديد سجل تجاري فرعي لشركة مساهمة
,1	,30	,الفرع الالكتروني,    321 , تجديد سجل تجاري رئيسي لفرع شركة اجنبية
,1	,30	,الفرع الالكتروني,    322 , تحويل فرع شركة خليجية أو مؤسسة مالكها خليجي إلى شركة مستقلة
,1	,30	,الفرع الالكتروني,    323 , تحويل سجل شركة رئيسي الى مؤسسة
,1	,30	,الفرع الالكتروني,    324 , تحويل الورثة مؤسسة مورثهم إلى شركة
,1	,30	,الفرع الالكتروني,    325 , تعديل سجل تجاري رئيسي لفرع شركة اجنبية
,1	,30	,الفرع الالكتروني,    326 , تعديل سجل تجاري رئيسي او فرعي لمؤسسة لمواطني دول مجلس التعاون
,1	,30	,الفرع الالكتروني,    327 , تحويل نوع سجل تجاري للشركات (رئيسي الى فرعي والعكس)
,1	,30	,الفرع الالكتروني,    328 , تحويل فرع شركة مساهمة إلى شركة مستقلة
,1	,30	,الفرع الالكتروني,    329 , تعديل سجل تجاري لشركة مساهمة
,1	,30	,الفرع الالكتروني,    330 , حجز اسم تجاري اجنبي بناء على اتفاقية بين شركة اجنبية وعميل سعودي
,1	,30	,الفرع الالكتروني,    331 , حجز اسم تجاري لجهة حكومية
,1	,30	,الفرع الالكتروني,    332 , حجز اسم تجاري لجمعية خيرية
,1	,30	,الفرع الالكتروني,    333 , حجز اسم تجاري للخليجيين
,1	,30	,الفرع الالكتروني,    334 , حجز اسم تجاري وقف
,1	,30	,الفرع الالكتروني,    335 , رفع الايقاف عن السجل بسبب الاسم التجاري
,1	,30	,الفرع الالكتروني,    336 , شطب سجل تجاري رئيسي لشركة اجنبية
,1	,30	,الفرع الالكتروني,    337 , شطب سجل تجاري رئيسي لشركة خليجية
,1	,30	,الفرع الالكتروني,    338 , شطب سجل تجاري رئيسي لشركة مختلطة
,1	,30	,الفرع الالكتروني,    339 , شطب سجل تجاري رئيسي لشركة وطنية
,1	,30	,الفرع الالكتروني,    340 , شطب سجل تجاري رئيسي وتحول الفرع لرئيسي لمؤسسة لسعودي.
,1	,30	,الفرع الالكتروني,    341 , شطب سجل تجاري لمؤسسة لسعودي
,1	,30	,الفرع الالكتروني,    342 , شطب سجل تجاري فرعي لشركة
,1	,30	,الفرع الالكتروني,    343 , شطب سجل تجاري لمؤسسة لمواطني دول مجلس التعاون
,1	,30	,الفرع الالكتروني,    344 , شطب سجل تجاري لمؤسسة لشخص متوفي
,1	,30	,الفرع الالكتروني,    345 , عقود التأسيس التي يكون أحد أطراف العقد شركة لا يمكن إجراء تحديث لها  مثل :(شركة سعودية نوعها محدودة برأس مال خليجي)
,1	,30	,الفرع الالكتروني,    346 , نقل ملكية سجل تجاري لشخص متوفي
,1	,30	,الفرع الالكتروني,    347 , عقود التأسيس التي يكون أحد أطراف العقد شركة مساهمة
,1	,30	,الفرع الالكتروني,    804010001 , تعديل ترجمة
,1	,32	,EFILE,    352 , استعادة كلمة المرور
,1	,32	,EFILE,    353 , التفاويض الإلكترونية
,1	,32	,EFILE,    354 , تسجيل مستخدم جديد
,1	,32	,EFILE,    355 , ايقاف / رفع ايقاف
,1	,32	,EFILE,    356 , تحديث بيانات
,1	,31	,Maroof,    357 , تعديل بيانات المتجر
,1	,31	,Maroof,    358 , إيقاف متجر
,1	,31	,Maroof,    359 , تفعيل متجر
,1	,31	,Maroof,    360 , إضافة متجر
,1	,31	,Maroof,    361 , إصدار سجل تجاري عن طريق معروف
,1	,33	,Renewal in one step,    362 , مؤسسات الفردية
,1	,33	,Renewal in one step,    363 , خدمات الشركات
,1	,66	,المخالفات التجارية,    234 , المخالفات التجارية
,1	,34	,SBC Services,    372 , إصدار سجل مؤسسة فردية SBC
,1	,34	,SBC Services,    373 ,  تعديل سجل مؤسسة SBC
,1	,34	,SBC Services,    374 ,  تجديد سجل مؤسسة SBC
,1	,34	,SBC Services,    375 ,  شطب سجل مؤسسة SBC
,1	,34	,SBC Services,    376 , تحويل نوع سجل مؤسسة SBC
,1	,34	,SBC Services,    377 ,  طباعة مستخرج سجل مؤسسة SBC
,1	,34	,SBC Services,    378 ,  طباعة شهادة سجل مؤسسة SBC
,1	,35	,المخالفات,    379 , اعتراض على مخالفة نظام الشركات
,1	,35	,المخالفات,    380 , مشكلة تقنية عند سداد المخالفة
,1	,35	,المخالفات,    381 , بيانات المخالفة غير صحيحة
,1	,35	,المخالفات,    382 , اعتراض  على مخالفة تجارية
,2	,1	,Administration,    1 , رفض الشكوى
,2	,1	,Administration,    2 , حل الشكوى
,2	,1	,Administration,    3 , توجيه إلى الوكالة المُشرعة
,2	,1	,Administration,    4 , تخص أدارة أخرى
,2	,2	,Technique,    1 , رفض الشكوى
,2	,2	,Technique,    2 , حل الشكوى
,2	,3	,Legislative,    1 , رفض الشكوى
,2	,3	,Legislative,    2 , حل الشكوى
,2	,3	,Legislative,    5 , تخص وكالة أخرى
,3	,1	,yes,    1 , رفض الشكوى
,3	,1	,yes,    2 , حل الشكوى
,4	,1	,Administration,    1 , إعادة و أستكمال البيانات
,4	,1	,Administration,    3 , توجيه إلى أدارة مختصة / وكالة مُشرعة
,4	,1	,Administration,    4 , رفض الشكوى
,4	,1	,Administration,    6 , حل الشكوي
,4	,2	,Technique,    1 , إعادة و أستكمال البيانات
,4	,2	,Technique,    2 , إنشاء / استكمال شكوى دعم فني
,4	,2	,Technique,    4 , رفض الشكوى
,4	,2	,Technique,    6 , حل الشكوي
,4	,3	,Legislative,    1 , إعادة و أستكمال البيانات
,4	,3	,Legislative,    3 , توجيه إلى أدارة مختصة / وكالة مُشرعة
,4	,3	,Legislative,    4 , رفض الشكوى
,4	,3	,Legislative,    6 , حل الشكوي
,5	,1	,السجل التجاري,    1 , النظام متوقف بالكامل
,5	,1	,السجل التجاري,    2 , تسجيل الدخول
,5	,1	,السجل التجاري,    3 , الدفع
,5	,1	,السجل التجاري,    6 , أخرى
,5	,2	,الاسماء التجارية,    1 , النظام متوقف بالكامل
,5	,2	,الاسماء التجارية,    2 , تسجيل الدخول
,5	,2	,الاسماء التجارية,    6 , أخرى
,5	,4	,خدمات المهن الاستشارية,    1 , النظام متوقف بالكامل
,5	,4	,خدمات المهن الاستشارية,    2 , تسجيل الدخول
,5	,4	,خدمات المهن الاستشارية,    3 , الدفع
,5	,5	,خدمات الشركات,    1 , النظام متوقف بالكامل
,5	,5	,خدمات الشركات,    2 , تسجيل الدخول
,5	,5	,خدمات الشركات,    3 , الدفع
,5	,5	,خدمات الشركات,    6 , أخرى
,5	,7	,تراخيص المختبرات,    6 , أخرى
,5	,8	,شهادة المنشأ,    1 , النظام متوقف بالكامل
,5	,8	,شهادة المنشأ,    2 , تسجيل الدخول
,5	,8	,شهادة المنشأ,    3 , الدفع
,5	,11	,الوكالات التجارية,    6 , أخرى
,5	,12	,تراخيص الذهب و المعادن الثمينة,    1 , النظام متوقف بالكامل
,5	,12	,تراخيص الذهب و المعادن الثمينة,    2 , تسجيل الدخول
,5	,12	,تراخيص الذهب و المعادن الثمينة,    3 , الدفع
,5	,12	,تراخيص الذهب و المعادن الثمينة,    6 , أخرى
,5	,13	,خدمات مكتب الفصل في المنازعات التجارية,    1 , النظام متوقف بالكامل
,5	,13	,خدمات مكتب الفصل في المنازعات التجارية,    2 , تسجيل الدخول
,5	,13	,خدمات مكتب الفصل في المنازعات التجارية,    3 , الدفع
,5	,13	,خدمات مكتب الفصل في المنازعات التجارية,    6 , أخرى
,5	,14	,تراخيص التخفيضات,    1 , النظام متوقف بالكامل
,5	,14	,تراخيص التخفيضات,    2 , تسجيل الدخول
,5	,14	,تراخيص التخفيضات,    3 , الدفع
,5	,15	,التصاريح الموسمية لمركبات الخدمات التموينية,    1 , النظام متوقف بالكامل
,5	,15	,التصاريح الموسمية لمركبات الخدمات التموينية,    2 , تسجيل الدخول
,5	,15	,التصاريح الموسمية لمركبات الخدمات التموينية,    3 , الدفع
,5	,15	,التصاريح الموسمية لمركبات الخدمات التموينية,    6 , أخرى
,5	,24	,التزام الشركات,    1 , النظام متوقف بالكامل
,5	,24	,التزام الشركات,    2 , تسجيل الدخول
,5	,24	,التزام الشركات,    3 , الدفع
,5	,24	,التزام الشركات,    6 , أخرى
,5	,25	,حوكمة الشركات,    1 , النظام متوقف بالكامل
,5	,25	,حوكمة الشركات,    2 , تسجيل الدخول
,5	,25	,حوكمة الشركات,    3 , الدفع
,5	,25	,حوكمة الشركات,    6 , أخرى
,5	,26	,الغرفة التجارية,    1 , النظام متوقف بالكامل
,5	,26	,الغرفة التجارية,    3 , الدفع
,5	,30	,الفرع الالكتروني,    1 , النظام متوقف بالكامل
,5	,30	,الفرع الالكتروني,    2 , تسجيل الدخول
,5	,30	,الفرع الالكتروني,    3 , الدفع
,5	,30	,الفرع الالكتروني,    6 , أخرى
,5	,31	,معروف,    1 , النظام متوقف بالكامل
,5	,31	,معروف,    2 , تسجيل الدخول
,5	,31	,معروف,    6 , أخرى
,5	,32	,الدخول الموحد,    2 , تسجيل الدخول
,5	,32	,الدخول الموحد,    5 , رمز التحقق
,5	,32	,الدخول الموحد,    6 , أخرى
`;

let arr = obj.split(',');
const len = arr.length;
console.log(arr.length);
let data = [
    { id: 0, text: 'Complaint Category, Service Main Classification', nodes: [] },
    { id: 2, text: 'Complaint Division, decision made in complaint solution', nodes: [] },
    { id: 3, text: 'Service Ecalation Complaint, decision made in complaint solution', nodes: [] },
    { id: 4, text: 'Complaint Division, Decision Made', nodes: [] }
    //{ id: 5, text: 'Main Classification, Complaint Technical Classification', nodes: [] }
];

for (let i = 0; i < len; i += 5/*each row */) {
    console.log(arr[i].trim());
    //get row data
    let parentTypeId = Number(arr[i].trim());
    let childId = Number(arr[i + 1].trim());
    let childTxt = arr[i + 2].trim();
    let subChildId = Number(arr[i + 3].trim());
    let subChildTxt = arr[i + 4].trim();
    let subOfSubChildId = null;
    let subOfSubChildTxt = null;
    //in case of service main class which is dependent for complaint category
    // add sub of sub
    if (parentTypeId == 1) {
        parentTypeId = 0; // based on obj data
        subOfSubChildId = subChildId;
        subOfSubChildTxt = subChildTxt;
        subChildId = childId;
        subChildTxt = null;
        childId = null;
        childTxt = null;
    }
    let parentTypeNode = data.find(el => el.id === parentTypeId);
    prepareParentNestedNodes(parentTypeNode, childId, childTxt, subChildId, subChildTxt, subOfSubChildId, subOfSubChildTxt);
};

function prepareParentNestedNodes(parentTypeNode, childId, childTxt, subChildId,
    subChildTxt, subOfSubChildId = null, subOfSubChildTxt = null) {
    if (parentTypeNode) {
        let childNode;

        if (childId == null && subChildId && subOfSubChildId) // so u have to search for corresponding child
            childNode = parentTypeNode.nodes.find(el => el.nodes?.some(x => x.id === subChildId));
        else
            childNode = parentTypeNode.nodes.find(el => el.id === childId);

        if (childNode) {
            let subChildNode = childNode.nodes?.find(el => el.id === subChildId);
            if (subChildNode) {
                let subOfSubChildNode = subChildNode.nodes?.find(el => el.id === subOfSubChildId);
                if (!subOfSubChildNode && subOfSubChildId)
                    subChildNode.nodes?.push({ id: subOfSubChildId, text: subOfSubChildTxt });
            }
            else {
                let subChildNode, subOfSubChildNode;
                if (subChildId) {
                    subChildNode = {
                        id: subChildId, text: subChildTxt,nodes:[]
                    };
                    if (subOfSubChildId) {
                        subOfSubChildNode = { id: subOfSubChildId, text: subOfSubChildTxt }
                        subChildNode.nodes.push(subOfSubChildNode);
                    }
                    childNode.nodes.push(subChildNode);
                }
            }
        }
        else {
            let childNode, subChildNode, subOfSubChildNode;
            if (childId) {
                childNode = {
                    id: childId, text: childTxt,nodes:[]
                };
                if (subChildId) {
                    subChildNode = {
                        id: subChildId, text: subChildTxt,nodes:[]
                    };
                    if (subOfSubChildId) {
                        subOfSubChildNode = { id: subOfSubChildId, text: subOfSubChildTxt }
                        subChildNode.nodes.push(subOfSubChildNode);
                    }
                    childNode.nodes.push(subChildNode);
                }
                parentTypeNode.nodes.push(childNode);
            }
        }
    }
}